app/controllers/carts_controller.rb

  def show
    @cart = Cart.last.line_items
---
SELECT  "carts".* FROM "carts" ORDER BY "carts"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def total
    @total = Cart.last.total_price
---
SELECT  "carts".* FROM "carts" ORDER BY "carts"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def delete
    cart = Cart.find(params[:id])
    cart.destroy
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 9]]