app/controllers/line_items_controller.rb

UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 17], ["updated_at", "2020-12-29 13:24:02.999904"], ["id", 88]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:id])
    @line_item = @cart.add_product(product.id)
    @line_item.save

UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2020-12-29 02:50:42.246352"], ["id", 89]]
---
  def update
    respond_to do |format|
      if @line_item.update(line_item_params)