app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-12-28 11:11:57.518458"], ["updated_at", "2020-12-28 11:11:57.518458"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 2], ["cart_id", 6], ["created_at", "2020-12-28 11:14:14.118196"], ["updated_at", "2020-12-28 11:14:14.118196"]]
---
  def show
    @cart = current_cart
    puts "+++++++++++++++++++++++++"
    puts params[:id]
    puts "+++++++++++++++++++++++++"
    product = Product.find(params[:id])
    @line_item = @cart.line_items.build(:product => product)
    @line_item.save

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-12-29 02:15:00.243719"], ["updated_at", "2020-12-29 02:15:00.243719"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 2], ["cart_id", 8], ["created_at", "2020-12-29 02:49:16.365534"], ["updated_at", "2020-12-29 02:49:16.365534"]]
---
  def create
    @cart = current_cart
    puts "+++++++++++++++++++++++++"
    puts params[:product_id]
    puts "+++++++++++++++++++++++++"
    product = Product.find(params[:product_id])
    @line_item = @cart.line_items.build(:product => product)

    respond_to do |format|
      if @line_item.save