app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "MyString"], ["description", "MyText"], ["image_url", "MyString"], ["price", "9.99"], ["created_at", "2020-12-28 04:28:59.885947"], ["updated_at", "2020-12-28 04:28:59.885947"]]